In [1]:
import pandas as pd

In [2]:
#딕셔너리 객체 생성
data_dic = {
	'year': [2025,2026, 2027],
	'sales': [100, 110, 2000]
}

data_dic

{'year': [2025, 2026, 2027], 'sales': [100, 110, 2000]}

In [3]:
# 딕셔너리를 이용해 데이터프레임 객체 생성
df1 = pd.DataFrame(data_dic)
df1

   year  sales
0  2025    100
1  2026    110
2  2027   2000

In [4]:
data2 = ['A', 'B', 'C', 'D', 'E']

df2 = pd.DataFrame([[89.2, 92.5, 90.8], [92.8, 89.9, 95.2]],
index = ['중간고사', '기말고사'], columns = data2[0:3])
df2

         A     B     C
중간고사  89.2  92.5  90.8
기말고사  92.8  89.9  95.2

In [5]:
data_df = [['20251101', 'Hong', '90', '95'], ['20251102',
'Kim', '93', '94'], ['20251103', 'Lee', '87', '97']]
df3 = pd.DataFrame(data_df)
df3

          0     1   2   3
0  20251101  Hong  90  95
1  20251102   Kim  93  94
2  20251103   Lee  87  97

In [6]:
df3.columns = ['학번', '이름', '중간고사', '기말고사']
df3

         학번    이름 중간고사 기말고사
0  20251101  Hong   90   95
1  20251102   Kim   93   94
2  20251103   Lee   87   97

In [7]:
df3.head(2)

         학번    이름 중간고사 기말고사
0  20251101  Hong   90   95
1  20251102   Kim   93   94

In [8]:
df3.tail(2)

         학번   이름 중간고사 기말고사
1  20251102  Kim   93   94
2  20251103  Lee   87   97

In [9]:
df3['이름']

0    Hong
1     Kim
2     Lee
Name: 이름, dtype: object

In [10]:
# 컬럼으로 열 삭제
df3.drop(columns='학번', inplace=True)
df3

     이름 중간고사 기말고사
0  Hong   90   95
1   Kim   93   94
2   Lee   87   97

In [11]:
# 인덱스로 행 삭제
df3.drop(0, inplace=True)
df3

    이름 중간고사 기말고사
1  Kim   93   94
2  Lee   87   97

In [12]:
df3

    이름 중간고사 기말고사
1  Kim   93   94
2  Lee   87   97

In [13]:
df3.rename(columns={df3.columns[0] : 'NAME', df3.columns[1] : 'midterm', df3.columns[2] : 'final'})

  NAME midterm final
1  Kim      93    94
2  Lee      87    97